# Evaluate Method (2023)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2023 API
---
FilterNumericGreater..::..Evaluate Method
FilterNumericGreater Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Evaluate(Int32, Int32) | Derived classes should override this method to implement the desired test.  (Inherited from FilterNumericRuleEvaluator.) |
| Evaluate(Double, Double, Double) | Derived classes override this method to implement the test that determines whether the two given double-precision values satisfy the desired condition or not.  (Inherited from FilterNumericRuleEvaluator.) |

# See Also
FilterNumericGreater Class
FilterNumericGreater Members
Autodesk.Revit.DB Namespace